import styles from './Rules.module.sass'

export default function Rules() {

    return (
        <>
            <div className={styles.rules}>
                <div className={styles.rules__container}>
                    <h2>Правила сервиса ChatGuru</h2>
                    <p>Настоящие Правила регулируют взаимоотношения между Администрацией сайта <a href="https://chat-guru.ru">https://chat-guru.ru</a> и Пользователями по использованию сайта и размещенных на нём материалов. Убедительно просим Вас внимательно ознакомиться с Правилами сервиса ChatGuru. В случае несогласия с какими-либо положениями Правил, Вы обязаны прекратить использовать сервисы и материалы сайта.</p>

                    <h3>Термины и определения:</h3>
                    <ul>
                        <li><strong>Администрация</strong> – ИП Швельня Павел Станиславович, ИНН: 590848534667, ОГРН: 323595800135682.</li>
                        <li><strong>Пользователь</strong> - дееспособное физическое лицо, достигшее 18 лет, использующее Сайт в собственных интересах, приобретающее или планирующее приобретать с помощью Сайта неисключительные права на использование ПК, прошедшее регистрацию на Сайте в установленном порядке.</li>
                        <li><strong>Программный Комплекс (ПК)</strong> – совокупность программных продуктов (программ), предназначенных для ЭВМ, управляемых операционными системами Linux, Windows и MacOS, а также мобильных устройств, управляемых операционными системами Google Android, iOS под общим наименованием "ChatGuru".</li>
                        <li><strong>Сайт</strong> - информационная система посредством информационно-телекоммуникационной сети «Интернет» под доменным именем <a href="https://chat-guru.ru">https://chat-guru.ru</a>.</li>
                        <li><strong>Сервисы</strong> - функциональные возможности, службы, инструменты, доступные для Пользователей на Сайте.</li>
                    </ul>

                    <h3>Регистрация:</h3>
                    <ul>
                        <li>Для получения неисключительных прав на использование ПК необходимо пройти процедуру регистрации на Сайте.</li>
                        <li>При совершении регистрации на Сайте, Пользователь принимает условия настоящих Правил и иных документов, размещённых на Сайте, которые регулируют взаимоотношения с Администрацией, в том числе выражает своё согласие на обработку персональных данных (текст согласия размещён в Политике конфиденциальности).</li>
                        <li>Пользователь гарантирует, что сведения, указанные при регистрации, являются актуальными и достоверными.</li>
                        <li>Для каждого Пользователя, регистрирующегося на Сайте, создается уникальная учетная запись и Личный кабинет для доступа к сервисам Сайта.</li>
                        <li>Вход в Личный кабинет осуществляется путем прохождения авторизации – введения логина и пароля Пользователя, которые приходят на почту после первичной оплаты подписки.</li>
                        <li>Пользователь обеспечивает конфиденциальность и безопасность учётных данных от Личного кабинета.</li>
                        <li>Пользователь несет полную ответственность за сохранность пароля, а также за все действия, произведенные с помощью своей учетной записи третьими лицами.</li>
                        <li>При невозможности совершения авторизации в связи с утратой пароля, блокировкой Личного кабинета и по иным причинам Пользователь вправе обратиться к Администрации <a href="mailto:help@chat-guru.ru">help@chat-guru.ru</a>.</li>
                        <li>Администрация оставляет за собой право изменять, отменять или дополнять способы восстановления доступа к Личному кабинету в одностороннем порядке.</li>
                    </ul>
                    <h2>Обязанности сторон</h2>
                    <h3>Обязанности Пользователя:</h3>
                    <ul>
                        <li>Строго придерживаться и не нарушать условий настоящих Правил, а также иных документов, регулирующих деятельность Сайта, взаимоотношения с Администрацией, размещённых на Сайте.</li>
                        <li>Соблюдать права и свободы третьих лиц.</li>
                        <li>Вести себя уважительно по отношению к Администрации и ко всем Пользователям Сайта.</li>
                        <li>Самостоятельно следить за изменениями настоящих Правил и иных документов, размещённых на Сайте.</li>
                        <li>Не осуществлять копирование, воспроизведение, изменение, распространение и представление информации, содержащейся на Сайте, без согласия Администрации.</li>
                        <li>Не предпринимать действий, направленных на нарушение нормальной работы Сайта или его отдельных сервисов.</li>
                        <li>Не передавать ПК, а также любые части ПК в сублицензию, а также не использовать иным образом, подразумевающим коммерческую выгоду от использования неисключительных прав на ПК.</li>
                    </ul>

                    <h3>Запрещается размещать на Сайте, комментарии, сообщения или иную информацию, содержащую:</h3>
                    <ul>
                        <li>Клевету и оскорбление.</li>
                        <li>Информацию непристойного характера.</li>
                        <li>Угрозы.</li>
                        <li>Рекламу любых товаров и услуг, ссылки на сайты и страницы в Интернете, СМИ или события, не относящиеся к контексту обсуждения статьи.</li>
                        <li>Сведения о частной жизни, персональные данные третьих лиц, личную и семейную тайны.</li>
                        <li>Государственную тайну, иные конфиденциальные сведения.</li>
                        <li>Ненормативную лексику.</li>
                        <li>Высказывания экстремистского характера.</li>
                        <li>Призывы к массовым беспорядкам, участию в массовых (публичных) мероприятиях, проводимых с нарушением установленного порядка, иным противоправным действиям.</li>
                        <li>Спам и троллинг.</li>
                    </ul>

                    <p>Запрещается размещать на Сайте комментарии, сообщения, иные материалы, которые нарушают интеллектуальную собственность третьих лиц.</p>

                    <p>Пользователь несет полную ответственность за собственные действия и бездействие при использовании Сайта, а также все риски, связанные с использованием им информации, полученной на Сайте.</p>

                    <p>Пользователям строго запрещается взятие счетов на раскрутку, просить в долг деньги.</p>

                    <p>Комментарии публикуются на Сайте сразу, без премодерации. Администрация имеет право удалить с Сайта любую информацию в любое время без объяснения причин.</p>

                    <h3>Права Администрации:</h3>
                    <ul>
                        <li>Изменять условия настоящих Правил.</li>
                        <li>Модерировать материалы, размещаемые Пользователями на Сайте, а также удалять любые комментарии, сообщения и другую информацию при нарушении настоящих Правил.</li>
                        <li>Блокировать Личный кабинет Пользователя при нарушении им законодательства или настоящих Правил.</li>
                        <li>Осуществлять рассылку новостей, а также другой полезной информации на указанные Пользователем при регистрации электронную почту, номер мобильного телефона, аккаунты в социальных сетях.</li>
                    </ul>
                    <p>Администрация не несет какой-либо ответственности за посещение и использование Пользователем других сайтов, ссылки на которые размещены на Сайте.</p>
                    <p>Информация на Сайте предоставляется по принципу «как есть». Администрация не гарантирует бесперебойного доступа к Сайту, отсутствие ошибок.</p>
                    <p>Администрация никаким образом не оказывает давление на Пользователя, не принуждает к совершению каких-либо действий. Вся ответственность за принятые решения и действия лежат на Пользователе.</p>
                    <p>Администрация отвечает за безопасность обрабатываемых персональных данных.</p>
                    <p>Администрация оставляет за собой право аннулировать подписку Пользователя, если:</p>
                    <ul>
                        <li>регистрационная или платежная информация Пользователя указана неправильно или не поддается проверке;</li>
                        <li>подписки Пользователя выглядят необычными или мошенническими;</li>
                        <li>у Администрации есть основания полагать, что Пользователем является несовершеннолетнее лицо;</li>
                        <li>у Администрации есть основания полагать, что Пользователь передает ПК, а также любые части ПК в сублицензию, а также использует иным образом, подразумевающим коммерческую выгоду от использования неисключительных прав на ПК;</li>
                        <li>у Администрации есть основания полагать, что третьи лица получили несанкционированный доступ к Личному кабинету Пользователя.</li>
                    </ul>

                    <h2>Интеллектуальная собственность</h2>
                    <p>Исключительное право на Сайт, размещенные на нем материалы, их название, элементы дизайна, статьи, графические изображения и иные произведения, размещенные на Сайте, принадлежит Администрации.</p>
                    <p>Любое использование, без письменного разрешения Администрации, названия Сайта, логотипов, размещенных на Сайте, элементов их дизайна запрещено.</p>
                    <p>Использование размещенных на Сайте материалов, их воспроизведение и распространение любыми способами, в том числе в сети Интернет, публичный показ, доведение до всеобщего сведения, копирование (полное и частичное), переделка, запрещены, за исключением случаев, когда получено письменное согласие Администрации на такие действия.</p>
                    <p>За нарушение авторских и исключительных прав предусмотрена уголовная и гражданская ответственность. Нарушения могут преследоваться Администрацией в судебном порядке.</p>

                    <h2>Урегулирование споров, порядок рассмотрения претензий</h2>
                    <p>Администрация прикладывает все усилия, чтобы не допустить нарушений чьих-либо прав.</p>
                    <p>В случае возникновения любых споров или разногласий Администрация прилагает все усилия для их разрешения путем переговоров.</p>
                    <p>В случае если Пользователь или третье лицо считает, что Администрацией каким-либо образом нарушены его права, имеет какие-либо претензии, он может обратиться к Администрации для урегулирования возникшего конфликта.</p>

                    <h2>Заключительные положения</h2>
                    <p>Правила вступают в силу с момента их опубликования на Сайте и действуют до момента публикации новой редакции Правил.</p>
                    <h2>Изменение условий Правил использования сайта</h2>
                    <p>Администрация оставляет за собой право изменить условия Правил в одностороннем порядке с обязательной публикацией изменений на Сайте или отозвать Правила в любой момент по своему усмотрению без уведомления Пользователей. В случае несогласия Пользователя с изменениями, он должен отказаться от пользования Сайтом.</p>
                    <p>Пользователи самостоятельно знакомятся с актуальной редакцией Правил на странице <a href="https://chat-guru.ru/rules">https://chat-guru.ru/rules</a>.</p>
                </div>
            </div>
        </>
    )
}